/*
* (C) Copyright 2011-2020 Compal Electronics, Inc.
 *
 * This software is the property of Compal Electronics, Inc.
 * You have to accept the terms in the license file before use.
 *
 * Copyright 2011-2020 Compal Electronics, Inc.. All rights reserved.

 By installing or using this software or any portion thereof, you ("You") agrees to be bound by the following terms of use ("Terms of Use").
 This software, and any portion thereof, is referred to herein as the "Software."

 USE OF SOFTWARE.  This software is the property of Compal Electronics, Inc. (Compal) and is made available by Compal to You, and may be used only by You for personal or project evaluation.

 RESTRICTIONS.  You shall not claim the ownership of the Software and shall not sell the Software. The software shall be distributed as pre-installed software incorporated in the devices manufactured by Compal only, and shall not be distributed separately via internet or any other medium.

 INDEMNITY.  You agree to hold harmless and indemnify Compal and Compal!|s subsidiaries, affiliates, officers, agents, and employees from and against any claim, suit, or action arising from or in any way related to Your use of the Software or Your violation of these Terms of Use, including any liability or expense arising from all claims, losses, damages, suits, judgments, litigation costs and attorneys' fees, of every kind and nature.
 In such a case, Compal will provide You with written notices of such claim, suit, or action.

 DISCLAIMER.  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#string STR_INVALID_INPUT                   #language en-US "Invalid input, please type 'CompalEcFlash -?'for help\n"
#string STR_COMPAL_ECFLASH_HELP             #language en-US "Compal Ec Flash Shell Tool.\n"
                                                            "The application is only for Ene or Nuvoton Chip used.\n\n"
                                                            "Usage: \n"
                                                            "  Options:\n"
                                                            "   -i                         Display EC information.\n"
                                                            "\n"
                                                            "   -t                         Toggle Enable/Disable CompalEcAutoFlash.\n"
                                                            "\n"
                                                            "   -f  FlashFile              Flash EC bios.\n"
                                                            "\n"
                                                            "   -a  FlashFile              Erase all of blocks before flashing EC BIOS.\n"
                                                            "\n"
                                                            "   -mc  [-f|-a]  FlashFile    Don't check Project Name before flashing EC BIOS.\n"
                                                            "\n"
                                                            "   -dump  DumpFile            Dump EC rom from system to DumpFile.\n"
                                                            "\n"
                                                            "   -eccw CMD DATA             Write command to EC.\n"
                                                            "\n"
                                                            "   -eccr CMD DATA             Read command from EC.\n"
                                                            "\n"
                                                            "   -?                         Help document.\n"
                                                            "\n"
                                                            "Examples:\n"
                                                            "  ComaplEcFlash -?\n"
                                                            "  ComaplEcFlash -i\n"
                                                            "  ComaplEcFlash -d\n"
                                                            "  ComaplEcFlash -f ECB.bin\n"
                                                            "  ComaplEcFlash -a ECB.bin\n"
                                                            "  ComaplEcFlash -mc -f ECB.bin\n"
                                                            "  ComaplEcFlash -dump ECB.bin\n"
                                                            "  ComaplEcFlash -eccw 59 F6\n"
                                                            "  ComaplEcFlash -eccr 52 A0\n"
